#написать shell-процедуру, которая:
#выводит символьную строку, содержащую два целых числа m и n, разделенную пробелами;
#читает содержимое файла, передаваемого в качестве первого параметра;
#выводит на экран каждые 5 секунд попеременно m строк из файла и n строк "Будь здоров"

#!/bin/bash
m=2
n=6
echo $m $n

cat $1 | while read y
do
	if [[ $n -eq 0 ]] && [[ $m -ne 0 ]]; then
		echo $y
		m=$((m-1))
	fi;
	if [[ $m -gt 0 ]] && [[ $n -gt 0 ]]; then
		echo $y
		echo "Будь здоров"
		m=$((m-1))
		n=$((n-1))
	fi;
	if [[ $m -eq 0 ]] && [[ $n -ne 0 ]]; then
		for (( i=1; i<=$n; i++ )); do
			echo "Будь здоров"
		done
		n=0
	fi;

	if [[ $n -eq 0 ]] && [[ $m -eq 0 ]]; then
		m=2
		n=6
		sleep 5s
	fi;
done
